Autodesk.Revit.DB.Visual.AssetProperties.FindByName(System.String)
Gets the property with the given name.
Remarks:
FindByName will not visit the properties of the asset connected to a property.
To visit the properties of the connected assets, use Item[String] instead.
name:
Name of the property.
Returns:
The property with the specified name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2018.1

Autodesk.Revit.DB.Visual.AssetProperties.Size
Gets the number of the AssetProperty(s) in the object.